Sumber Dataset: https://www.kaggle.com/datasets/kekavigi/earthquakes-in-indonesia

### Install Library

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = pd.read_csv('katalog_gempa.csv')
data.head()

,tgl,ot,lat,lon,depth,mag,remark,strike1,dip1,rake1,strike2,dip2,rake2
0,2008/11/01,21:02:43.058,-9.18,119.06,10,4.9,Sumba Region - Indonesia,NaN,NaN,NaN,NaN,NaN,NaN
1,2008/11/01,20:58:50.248,-6.55,129.64,10,4.6,Banda Sea,NaN,NaN,NaN,NaN,NaN,NaN
2,2008/11/01,17:43:12.941,-7.01,106.63,121,3.7,Java - Indonesia,NaN,NaN,NaN,NaN,NaN,NaN
3,2008/11/01,16:24:14.755,-3.30,127.85,10,3.2,Seram - Indonesia,NaN,NaN,NaN,NaN,NaN,NaN
4,2008/11/01,16:20:37.327,-6.41,129.54,70,4.3,Banda Sea,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
data = data.drop(columns=['strike1', 'dip1', 'rake1', 'strike2', 'dip2', 'rake2'])

In [4]:
data.head()

,tgl,ot,lat,lon,depth,mag,remark
0,2008/11/01,21:02:43.058,-9.18,119.06,10,4.9,Sumba Region - Indonesia
1,2008/11/01,20:58:50.248,-6.55,129.64,10,4.6,Banda Sea
2,2008/11/01,17:43:12.941,-7.01,106.63,121,3.7,Java - Indonesia
3,2008/11/01,16:24:14.755,-3.30,127.85,10,3.2,Seram - Indonesia
4,2008/11/01,16:20:37.327,-6.41,129.54,70,4.3,Banda Sea

### Data Exploration

In [5]:
data.shape

(92227, 7)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92227 entries, 0 to 92226
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   tgl     92227 non-null  object
 1   ot      92227 non-null  object
 2   lat     92227 non-null  float64
 3   lon     92227 non-null  float64
 4   depth   92227 non-null  int64
 5   mag     92227 non-null  float64
 6   remark  92227 non-null  object
dtypes: float64(3), int64(1), object(3)
memory usage: 4.9+ MB

In [7]:
data['tgl'] = pd.to_datetime(data['tgl'])

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92227 entries, 0 to 92226
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   tgl     92227 non-null  datetime64[ns]
 1   ot      92227 non-null  object
 2   lat     92227 non-null  float64
 3   lon     92227 non-null  float64
 4   depth   92227 non-null  int64
 5   mag     92227 non-null  float64
 6   remark  92227 non-null  object
dtypes: datetime64[ns](1), float64(3), int64(1), object(2)
memory usage: 4.9+ MB

In [9]:
data.isnull().sum()

tgl       0
ot        0
lat       0
lon       0
depth     0
mag       0
remark    0
dtype: int64

In [12]:
data['tgl'].nunique()

4398

In [13]:
data['depth'].nunique()

654

In [14]:
data['mag'].nunique()

67

In [15]:
data['remark'].nunique()

51